Revit 2023 API
FaceEdgeNode Class
 An output node that represents a Face edge.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2020
Syntax
C#
public class FaceEdgeNode : FaceDetailNode
Visual Basic
Public Class FaceEdgeNode _
	Inherits FaceDetailNode
Visual C++
public ref class FaceEdgeNode : public FaceDetailNode
Remarks
 See also: OnFaceEdge2D(FaceEdgeNode).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.FaceDetailNode
 Autodesk.Revit.DB.FaceEdgeNode
See Also
FaceEdgeNode Members
Autodesk.Revit.DB Namespace